uhnp/src/DataProcessors/ВыгрузкаЭД_ПоПотокам/ВыгрузкаЭД_ПоПотокам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВыгрузкаЭД_ПоПотокам</name>
  <comment>//Смирнов Д.А. 04.07.2025 Выполнение задач №000052291</comment>
  <attributes>
    <name>КоличествоПотоков</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОператорЭДО</name>
    <type>
      <types>EnumRef.тн_ОператорыЭДО</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЗаписейДляВыборки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:DataProcessor>

uhnp/src/Enums/тн_ОператорыЭДО/тн_ОператорыЭДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>тн_ОператорыЭДО</name>
  <comment>//Смирнов Д.А. 04.07.2025 Выполнение задач №000052291</comment>
  <enumValues>
    <name>Диадок</name>
  </enumValues>
  <enumValues>
    <name>Корус</name>
  </enumValues>
  <enumValues>
    <name>Такском</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Catalogs/Диадок_Документы/Диадок_Документы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Диадок_Документы</name>
  <comment>Выполнение задач №000042859</comment>
  <attributes>
    <name>ВидДокумента</name>
    <type>
      <types>CatalogRef.Диадок_ДополнительныеСправочники</types>
    </type>
  </attributes>
  <attributes>
    <name>Пакет</name>
    <comment>//ссылка на пакет документов, отправляемых вместе</comment>
    <type>
      <types>CatalogRef.Диадок_ПакетыДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>Документ</name>
    <type>
      <types>DocumentRef</types>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяОбработка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяДействие</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуемоеДействие</name>
    <type>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Хранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Метка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗагрузки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <comment>//из Диадока. Возможно, понадобится справочник</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныйСтатус</name>
    <comment>Статус согласования, отображаемый в веб-интерфейсе</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>70</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>BoxId</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DocumentId</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>LetterId</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DepartmentId</name>
    <comment>Идентификатор текущего подразделения документа в Диадоке</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтрагентДиадок</name>
    <type>
      <types>CatalogRef.Диадок_ЮрФизЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияДиадок</name>
    <type>
      <types>CatalogRef.Диадок_ЮрФизЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеДиадок</name>
    <type>
      <types>CatalogRef.Диадок_ЮрФизЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеКонтента</name>
    <comment>Будет удалено в следующем релизе в связи с переносом в справочник &quot;Диадок_ХранениеДанных&quot;</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>АнализПроведен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуемоеДействиеВ1С</name>
    <comment>Любой идентификатор, обработка которого реализована в подключаемом модуле</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТребуемоеДействиеВДД</name>
    <comment>Подписать / ОтказатьВПодписи / ЗапроситьУточнение</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеОтвета</name>
    <comment>Например, Титул Покупателя для документов в формате ФНС (ТОРГ12, Акт, УПД)</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ФункцияДокумента</name>
    <comment>Заполняется для УПД и УКД. Варианты: Invoice, Basic, InvoiceAndBasic</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипКонтента</name>
    <comment>Заполняется для документов типа Invoice и XmlTorg12 в формате 155 приказа (УПД).</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайла</name>
    <comment>Исходное имя файла</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PacketId</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>WorkflowId</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>тн_ИНН</name>
    <comment>//Шичкин Е. 10.05.2023 ВЗ №000045421</comment>
    <type>
      <types>DefinedType.ИНН</types>
    </type>
  </attributes>
  <attributes>
    <name>тн_КПП</name>
    <comment>//Шичкин Е. 10.05.2023 ВЗ №000045421</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>ИмяРеквизита</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>DocumentRef</types>
        <types>EnumRef</types>
        <types>CatalogRef</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеХранилищеЗначения</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/DataProcessors/ВыгрузкаЭД_ПоПотокам/Forms/Форма/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Объект.КоличествоПотоков = 6;
	Объект.ОператорЭДО = Перечисления.тн_ОператорыЭДО.Диадок;
	
	ОбновитьКоличествоЗарегистрированных();	
	
КонецПроцедуры

#Область Служебные

&НаСервере
Процедура ОбновитьКоличествоЗарегистрированных()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЭтотУзел", ПланыОбмена.ЭлектронныеДокументы.ЭтотУзел());
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КОЛИЧЕСТВО(Диадок_ДокументыИзменения.Ссылка) КАК КоличествоДокументов
	|ИЗ
	|	Справочник.Диадок_Документы.Изменения КАК Диадок_ДокументыИзменения";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗарегистрированоКОбмену = Выборка.КоличествоДокументов;
	Иначе
		ЗарегистрированоКОбмену = 0;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВыполнитьЗапускФЗ(НаименованиеФЗ, СписокПараметров)
	
	КлючФЗ = Новый УникальныйИдентификатор;
	
	Задание = ФоновыеЗадания.Выполнить("тн_ВыгрузкаЭлектронныхДокументов.ВыгрузитьЭлектронныеДокументы", СписокПараметров, КлючФЗ, НаименованиеФЗ);
	
	ИдентификаторЗадания = Задание.УникальныйИдентификатор;
	
	Возврат ИдентификаторЗадания;
	
КонецФункции // ВыполнитьЗапускФЗ

&НаСервереБезКонтекста
Функция ПолучитьСписокУзлов()
	
	СписокУзловОбмена = Новый Массив;	
	
	ВыборкаУзлов = ПланыОбмена.ЭлектронныеДокументы.Выбрать();
	Пока ВыборкаУзлов.Следующий() Цикл
		
		УзелОбмена = ВыборкаУзлов.Ссылка;
		
		Если УзелОбмена <> ПланыОбмена.ЭлектронныеДокументы.ЭтотУзел() Тогда
			
			СписокУзловОбмена.Добавить(УзелОбмена);
			ПланыОбмена.ВыбратьИзменения(УзелОбмена, 1);
			
		КонецЕсли;
		
	КонецЦикла;	
	
	Возврат СписокУзловОбмена;
	
КонецФункции // ПолучитьСписокУзлов()

//~ Смирнов Д.А. 11.12.2025 Выполнение задач №000055967 : + Индикатор				
//&НаСервереБезКонтекста
//Функция ПроверитьВыполнениеФЗ(СписокВыполняющихсяФЗ, Знач ОтборСостояниеФЗ, КоличествоПотоков)
&НаСервереБезКонтекста
Функция ПроверитьВыполнениеФЗ(СписокВыполняющихсяФЗ, Знач ОтборСостояниеФЗ, КоличествоПотоков, Индикатор = 0)

	СписокСостоянийФЗ_Завершено = Новый Массив;
	СписокСостоянийФЗ_Завершено.Добавить(СостояниеФоновогоЗадания.Завершено);
	СписокСостоянийФЗ_Завершено.Добавить(СостояниеФоновогоЗадания.ЗавершеноАварийно);
	
	Сч = 0;
	Пока Сч <= СписокВыполняющихсяФЗ.ВГраница() Цикл
		
		ОтборСостояниеФЗ.УникальныйИдентификатор = СписокВыполняющихсяФЗ[Сч];
		
		СписокВыполняющихсяЗаданий = ФоновыеЗадания.ПолучитьФоновыеЗадания(ОтборСостояниеФЗ);
		
		Если СписокВыполняющихсяЗаданий.Количество() = 0 Тогда
			
			СписокВыполняющихсяФЗ.Удалить(Сч);
			// НАЧАЛО Смирнов Д.А. 11.12.2025 Выполнение задач №000055967
			Индикатор = Индикатор + 1;
			// КОНЕЦ Смирнов Д.А. 11.12.2025 Выполнение задач №000055967	
			Сч = Сч - 1;
			
		ИначеЕсли СписокСостоянийФЗ_Завершено.Найти(СписокВыполняющихсяЗаданий[0].Состояние) <> Неопределено Тогда	

			СписокВыполняющихсяФЗ.Удалить(Сч);
			// НАЧАЛО Смирнов Д.А. 11.12.2025 Выполнение задач №000055967
			Индикатор = Индикатор + 1;
			// КОНЕЦ Смирнов Д.А. 11.12.2025 Выполнение задач №000055967	
			Сч = Сч - 1;

		КонецЕсли;
		
		Сч = Сч + 1;		
		
	КонецЦикла;
	
	Возврат СписокВыполняющихсяФЗ.Количество() < КоличествоПотоков;
	
КонецФункции // ПроверитьВыполнениеФЗ()

#КонецОбласти // Служебные

#Область ВыгрузкаПоСпискуЭД

&НаСервереБезКонтекста
Функция ПолучитьСписокЭД(КоличествоЗаписейДляВыборки, СписокУзлов)
	
	ТекстПервыеЗаписи = ?(КоличествоЗаписейДляВыборки = 0, "", "ПЕРВЫЕ " + Формат(КоличествоЗаписейДляВыборки, "ЧГ="));
	
	СписокЭД = Новый Массив;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ " + ТекстПервыеЗаписи + "
	|	Диадок_ДокументыИзменения.Ссылка КАК ЭлектронныйДокумент
	|ИЗ
	|	Справочник.Диадок_Документы.Изменения КАК Диадок_ДокументыИзменения
	|ГДЕ
	|	Диадок_ДокументыИзменения.Узел В(&СписокУзлов)
	|	И Диадок_ДокументыИзменения.НомерСообщения = 1";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("СписокУзлов", СписокУзлов);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СписокЭД.Добавить(Выборка.ЭлектронныйДокумент);
		
	КонецЦикла;
	
	Возврат СписокЭД;
	
КонецФункции // ПолучитьСписокЭД()

&НаКлиенте
Процедура ВыполнитьВыгрузкуПоСпискуЭД(Команда)

	Если Не ПроверитьЗаполнение() Тогда
		
		Возврат;
		
	КонецЕсли;
	
	СписокУзловОбмена = ПолучитьСписокУзлов();
	ДанныеПрофиля = тн_ВыгрузкаЭлектронныхДокументов.ПолучитьДанныеПрофиляХраненияФайловЭД(Объект.ОператорЭДО);
	
	Если Не ДанныеПрофиля.Используется Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Профиль хранения файлов ЭД для оператора ЭДО '" + Строка(Объект.ОператорЭДО) +"' не используется!");
		Возврат;	
	КонецЕсли;
	
	КоличествоДокументовВПакете = ДанныеПрофиля.КоличествоДокументовВПакете;
	СписокЭД = ПолучитьСписокЭД(Объект.КоличествоЗаписейДляВыборки, СписокУзловОбмена);
		
	ИндикаторВыборки = 0;
	Элементы.ИндикаторВыборки.МаксимальноеЗначение = СписокЭД.Количество();
	
	Элементы.ИндикаторВыборки.Заголовок = "Прогресс выборки документов";
	
	ОтборСостояниеФЗ = Новый Структура;
	ОтборСостояниеФЗ.Вставить("УникальныйИдентификатор", "");
		
	СписокВыполняющихсяФЗ = Новый Массив;
	
	МассивВсехФЗ = Новый Массив;
	// НАЧАЛО Смирнов Д.А. 11.12.2025 Выполнение задач №000055967
	Индикатор = 0;
	// КОНЕЦ Смирнов Д.А. 11.12.2025 Выполнение задач №000055967	
	Если СписокЭД.Количество() <= КоличествоДокументовВПакете Тогда
		
		ИдентификаторЗадания = ЗапуститьВыполнениеФЗ_СписокЭД(СписокЭД);
		МассивВсехФЗ.Добавить(ИдентификаторЗадания);
		
		// НАЧАЛО Смирнов Д.А. 11.12.2025 Выполнение задач №000055967
		//Индикатор = 0;
		// КОНЕЦ Смирнов Д.А. 11.12.2025 Выполнение задач №000055967	
		Элементы.Индикатор.МаксимальноеЗначение = МассивВсехФЗ.Количество();
		
		ДополнитьСписокВыполняющихсяФЗ(ИдентификаторЗадания, СписокВыполняющихсяФЗ);
		ИндикаторВыборки = СписокЭД.Количество();
		
	Иначе
		
		СписокЭД_ДляОбработки = Новый Массив;
		Для Каждого ЭлементМассива Из СписокЭД Цикл
			
			ОбработкаПрерыванияПользователя();
			
			Если ЭтоАдресВременногоХранилища(АдресВХВыполняемыеФЗ) Тогда
				СписокАктивныхВЗ = ПолучитьИзВременногоХранилища(АдресВХВыполняемыеФЗ);
				Если ТипЗнч(СписокАктивныхВЗ) = Тип("Массив") Тогда
					СписокВыполняющихсяФЗ = СписокАктивныхВЗ;	
				КонецЕсли;
			КонецЕсли;
			
			СписокЭД_ДляОбработки.Добавить(ЭлементМассива);
			
			Если СписокЭД_ДляОбработки.Количество() >= КоличествоДокументовВПакете Тогда
				
				Если СписокВыполняющихсяФЗ.Количество() >= Объект.КоличествоПотоков Тогда
					
					ВыполнитьФЗ = Ложь;
					Пока Не ВыполнитьФЗ Цикл
						
						ОбработкаПрерыванияПользователя();
						ВыполнитьФЗ = ПроверитьВыполнениеФЗ(СписокВыполняющихсяФЗ, ОтборСостояниеФЗ, Объект.КоличествоПотоков);	
						
					КонецЦикла;
					
				КонецЕсли;
					
				ИдентификаторЗадания = ЗапуститьВыполнениеФЗ_СписокЭД(СписокЭД_ДляОбработки);
				МассивВсехФЗ.Добавить(ИдентификаторЗадания);
				Если ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
					
					ДополнитьСписокВыполняющихсяФЗ(ИдентификаторЗадания, СписокВыполняющихсяФЗ);
					СписокЭД_ДляОбработки.Очистить();
					
				КонецЕсли;					
				
			КонецЕсли;
			
			ИндикаторВыборки = ИндикаторВыборки + 1;
			Элементы.ИндикаторВыборки.Заголовок = "Прогресс выборки документов" + "("+ Строка(ИндикаторВыборки) + " из " + Строка(СписокЭД.Количество()) + ")";
			
			ВывестиКоличествоЗапущенныхФЗ();
			
			// НАЧАЛО Смирнов Д.А. 11.12.2025 Выполнение задач №000055967
			ПроверитьВыполнениеФЗ(СписокВыполняющихсяФЗ, ОтборСостояниеФЗ, Объект.КоличествоПотоков, Индикатор);
			// КОНЕЦ Смирнов Д.А. 11.12.2025 Выполнение задач №000055967	
		КонецЦикла;
		
		СписокВыполняющихсяФЗ.Очистить();
				
		Если СписокЭД_ДляОбработки.Количество() > 0 Тогда
			
			ИдентификаторЗадания = ЗапуститьВыполнениеФЗ_СписокЭД(СписокЭД_ДляОбработки);
			МассивВсехФЗ.Добавить(ИдентификаторЗадания);
			
			ДополнитьСписокВыполняющихсяФЗ(ИдентификаторЗадания, СписокВыполняющихсяФЗ);
			ИндикаторВыборки = СписокЭД.Количество();
			
		КонецЕсли;
		
		// НАЧАЛО Смирнов Д.А. 11.12.2025 Выполнение задач №000055967
		//Индикатор = 0;
		// КОНЕЦ Смирнов Д.А. 11.12.2025 Выполнение задач №000055967	
		Элементы.Индикатор.МаксимальноеЗначение = МассивВсехФЗ.Количество();
		ПодключитьОбработчикОжидания("ПодсчетВыполненныхФЗ", 10, Ложь);
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ВывестиКоличествоЗапущенныхФЗ()
	
	Если ЭтоАдресВременногоХранилища(АдресВХВыполняемыеФЗ) Тогда
		СписокФЗ = ПолучитьИзВременногоХранилища(АдресВХВыполняемыеФЗ);
		Если ЗначениеЗаполнено(СписокФЗ) Тогда
			КоличествоЗапущенныхФЗ = СписокФЗ.Количество();
		Иначе 
			КоличествоЗапущенныхФЗ = 0;
		КонецЕсли;                     
	Иначе
		КоличествоЗапущенныхФЗ = 0;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДополнитьСписокВыполняющихсяФЗ(ИдентификаторЗадания, СписокВыполняющихсяФЗ)
	
	Если ЭтоАдресВременногоХранилища(АдресВХВыполняемыеФЗ) Тогда
		СписокФЗ = ПолучитьИзВременногоХранилища(АдресВХВыполняемыеФЗ);
		УдалитьИзВременногоХранилища(АдресВХВыполняемыеФЗ);
		Если ТипЗнч(СписокФЗ) = Тип("Массив") Тогда
			СписокФЗ.Добавить(ИдентификаторЗадания);
			АдресВХВыполняемыеФЗ = ПоместитьВоВременноеХранилище(СписокФЗ, Новый УникальныйИдентификатор);
		Иначе
			СписокВыполняющихсяФЗ.Добавить(ИдентификаторЗадания);
			АдресВХВыполняемыеФЗ = ПоместитьВоВременноеХранилище(СписокВыполняющихсяФЗ, Новый УникальныйИдентификатор);
		КонецЕсли;
	Иначе
		СписокВыполняющихсяФЗ.Добавить(ИдентификаторЗадания);
		АдресВХВыполняемыеФЗ = ПоместитьВоВременноеХранилище(СписокВыполняющихсяФЗ, Новый УникальныйИдентификатор);
	КонецЕсли;
	
	// НАЧАЛО Смирнов Д.А. 11.12.2025 Выполнение задач №000055967 
	//Индикатор = ПолучитьЗначениеПрогрессаСервер();
	// КОНЕЦ Смирнов Д.А. 11.12.2025 Выполнение задач №000055967	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьЗначениеПрогрессаСервер()
	
	МассивВыполняемых = Новый Массив;
	
	ТекущееЗначениеИндикатора = Индикатор;
	
	Если ЭтоАдресВременногоХранилища(АдресВХВыполняемыеФЗ) Тогда
		
		СписокВыполняющихсяФЗ = ПолучитьИзВременногоХранилища(АдресВХВыполняемыеФЗ);
		
		// НАЧАЛО Смирнов Д.А. 11.12.2025 Выполнение задач №000055967
		//Если ЗначениеЗаполнено(СписокВыполняющихсяФЗ) Тогда
		//	
		//	Для Каждого ИДФонового Из СписокВыполняющихсяФЗ Цикл
		//		
		//		ТекущееФЗ = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ИДФонового);
		//		
		//		Если Не ТекущееФЗ = Неопределено Тогда
		//			
		//			МассивЗавершающихСостояний = ПолучитьСостоянияЗавершенияФЗ();
		//			
		//			Если Не МассивЗавершающихСостояний.Найти(ТекущееФЗ.Состояние) = Неопределено Тогда
		//				
		//				ТекущееЗначениеИндикатора = ТекущееЗначениеИндикатора + 1;	
		//				
		//			Иначе
		//				
		//				МассивВыполняемых.Добавить(ИДФонового);
		//				
		//			КонецЕсли;
		//			
		//		КонецЕсли;
		//		
		//	КонецЦикла;
		//	
		//КонецЕсли;
		//		
		//АдресВХВыполняемыеФЗ = ПоместитьВоВременноеХранилище(МассивВыполняемых, Новый УникальныйИдентификатор);
		
		ОтборСостояниеФЗ = Новый Структура;
		ОтборСостояниеФЗ.Вставить("УникальныйИдентификатор", "");
		ПроверитьВыполнениеФЗ(СписокВыполняющихсяФЗ, ОтборСостояниеФЗ, Объект.КоличествоПотоков, ТекущееЗначениеИндикатора);		
		// КОНЕЦ Смирнов Д.А. 11.12.2025 Выполнение задач №000055967
		
	КонецЕсли;
	
	Возврат ТекущееЗначениеИндикатора;
		
КонецФункции

&НаКлиенте
Процедура ПодсчетВыполненныхФЗ()
	
	Индикатор = ПолучитьЗначениеПрогрессаСервер();	
	ВывестиКоличествоЗапущенныхФЗ();
	
	Если КоличествоЗапущенныхФЗ = 0 Тогда
		ОтключитьОбработчикОжидания("ПодсчетВыполненныхФЗ");	
	КонецЕсли;
	
	ОбновитьКоличествоЗарегистрированных();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСостоянияЗавершенияФЗ()
	
	МассивСтатусов = Новый Массив;
	МассивСтатусов.Добавить(СостояниеФоновогоЗадания.Завершено);
	МассивСтатусов.Добавить(СостояниеФоновогоЗадания.ЗавершеноАварийно);
	МассивСтатусов.Добавить(СостояниеФоновогоЗадания.Отменено);
	
	Возврат МассивСтатусов;
	
КонецФункции

&НаСервереБезКонтекста
Функция ЗапуститьВыполнениеФЗ_СписокЭД(СписокЭД)
	
	СписокПараметров = Новый Массив;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("СписокЭД", СписокЭД);
	СписокПараметров.Добавить(ДополнительныеПараметры);
	
	НаименованиеФЗ = "Выгрузка электронных документов (в разрезе электронных документов).";
	
	ИдентификаторЗадания = ВыполнитьЗапускФЗ(НаименованиеФЗ, СписокПараметров);
	
	Возврат ИдентификаторЗадания;
	
КонецФункции // ЗапуститьВыполнениеФЗ_СписокЭД()

#КонецОбласти // ВыгрузкаПоСпискуЭД

#Область ВыгрузкаПоПериоду

&НаСервереБезКонтекста
Функция ПолучитьСписокПериодовДляОбработки()
	
	СписокПериодов = Новый Массив;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МИНИМУМ(ВЫБОР
	|			КОГДА Диадок_Документы.ДатаЗагрузки > Диадок_Документы.ДатаДокумента
	|				ТОГДА Диадок_Документы.ДатаЗагрузки
	|			ИНАЧЕ Диадок_Документы.ДатаДокумента
	|		КОНЕЦ) КАК МинимальнаяДатаСоздания,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА Диадок_Документы.ДатаЗагрузки > Диадок_Документы.ДатаДокумента
	|				ТОГДА Диадок_Документы.ДатаЗагрузки
	|			ИНАЧЕ Диадок_Документы.ДатаДокумента
	|		КОНЕЦ) КАК МаксимальнаяДатаСоздания
	|ИЗ
	|	Справочник.Диадок_Документы КАК Диадок_Документы
	|ГДЕ
	|	(Диадок_Документы.ДатаДокумента <> &ПустаяДата
	|			ИЛИ Диадок_Документы.ДатаЗагрузки <> &ПустаяДата)";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("ПустаяДата", '00010101');
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Если Выборка.Следующий() Тогда
		
		НачалоПериода = НачалоМесяца(Выборка.МинимальнаяДатаСоздания);
		КонецПериода = КонецМесяца(Выборка.МаксимальнаяДатаСоздания);
		
		ПериодОбработки = Новый Структура;
		ПериодОбработки.Вставить("ДатаНачала", '00010101');
		ПериодОбработки.Вставить("ДатаОкончания", '00010101');
		
		Пока НачалоПериода <= КонецПериода Цикл
			
			КонецМесяцаНачалаПериода = ДобавитьМесяц(НачалоПериода, 1)-1;
			
			ПериодОбработки.ДатаНачала = НачалоПериода;
			ПериодОбработки.ДатаОкончания = КонецМесяцаНачалаПериода;
			
			СписокПериодов.Добавить(ПериодОбработки);
			
			НачалоПериода = КонецМесяцаНачалаПериода+1;
			
		КонецЦикла;
		
	КонецЕсли;
		

	Возврат СписокПериодов;
	
КонецФункции // ПолучитьСписокПериодовДляОбработки()

&НаКлиенте
Процедура ВыполнитьВыгрузкуПоПериоду(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		
		Возврат;
		
	КонецЕсли;
	
	СписокПериодов = ПолучитьСписокПериодовДляОбработки();
	
	ОтборСостояниеФЗ = Новый Структура;
	ОтборСостояниеФЗ.Вставить("УникальныйИдентификатор", "");
	
	СписокВыполняющихсяФЗ = Новый Массив;
	Сч = 0;
	Пока Сч < СписокПериодов.ВГраница() Цикл
		
		ПериодОбработки = СписокПериодов[Сч];
		
		ОбработкаПрерыванияПользователя();
		
		ВыполнитьФЗ = Истина;
		Если СписокВыполняющихсяФЗ.Количество() >= Объект.КоличествоПотоков Тогда
			
			ВыполнитьФЗ = ПроверитьВыполнениеФЗ(СписокВыполняющихсяФЗ, ОтборСостояниеФЗ, Объект.КоличествоПотоков);	
			
		КонецЕсли;
		
		Если ВыполнитьФЗ Тогда
			
			ИдентификаторЗадания = ЗапуститьВыполнениеФЗ_ПоПериоду(ПериодОбработки.ДатаНачала, ПериодОбработки.ДатаОкончания);
			Если ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
				
				СписокВыполняющихсяФЗ.Добавить(ИдентификаторЗадания);
				
			КонецЕсли;
			
			Сч = Сч + 1;
			
		КонецЕсли;
		
	КонецЦикла;	
	
КонецПроцедуры // ВыполнитьВыгрузку()

&НаСервереБезКонтекста
Функция ЗапуститьВыполнениеФЗ_ПоПериоду(ДатаНачала, ДатаОкончания)
	
	СписокПараметров = Новый Массив;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ДатаНачала", ДатаНачала);
	ДополнительныеПараметры.Вставить("ДатаОкончания", ДатаОкончания);
	СписокПараметров.Добавить(ДополнительныеПараметры);
	
	НаименованиеФЗ = "Выгрузка электронных документов (в разрезе периодов).";	
	
	ИдентификаторЗадания = ВыполнитьЗапускФЗ(НаименованиеФЗ, СписокПараметров);
	
	Возврат ИдентификаторЗадания;
	
КонецФункции // ЗапуститьВыполнениеФЗ_ПоПериоду()

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОтключитьОбработчикОжидания("ПодсчетВыполненныхФЗ");
	Если ЭтоАдресВременногоХранилища(АдресВХВыполняемыеФЗ) Тогда
		ОтменитьФоновыеЗадания();
		УдалитьИзВременногоХранилища(АдресВХВыполняемыеФЗ);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОтменитьФоновыеЗадания()
	
	Если ЭтоАдресВременногоХранилища(АдресВХВыполняемыеФЗ) Тогда
		СписокФЗ = ПолучитьИзВременногоХранилища(АдресВХВыполняемыеФЗ);
		Если ЗначениеЗаполнено(СписокФЗ) Тогда
			Для Каждого ИДФонового Из СписокФЗ Цикл
				
				ТекущееФЗ = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ИДФонового);
				
				Если Не ТекущееФЗ = Неопределено Тогда
					ТекущееФЗ.Отменить();	
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // ВыгрузкаПоПериоду
